{
  "project_id": "jesusparis",
  "target_path": "n0.production_summary",
  "writing_typology": "summary",
  "strategy_id": "summary_v1",
  "strategy_question": "Find in the documents rules and guidance to write a clear, factual production summary for stakeholders.",
  "strategy_text": "In crafting a production summary for stakeholders, it is essential to adhere to a structured approach that balances clarity, conciseness, and factual accuracy, as outlined in the project brief. The film project in question is a two-hour cinematic exploration set in the vibrant cityscape of Paris, focusing on a narrative that intertwines the life of Jesus with elements of nostalgia and bitter humor. The primary objective is to create a film that not only adheres to the specified duration but also effectively captures the intended nostalgic tone and humor, which are integral to the storytelling. The narrative is designed to evoke a sense of longing and reflection, while simultaneously incorporating a layer of humor that is both sharp and poignant, providing a unique juxtaposition that enhances the film's emotional depth. This approach aligns with the principles discussed by Yves Lavandier in 'Construire un recit,' where the importance of a well-structured synopsis is emphasized, ensuring that the core narrative is communicated succinctly yet compellingly. The setting of Paris is not merely a backdrop but a character in its own right, contributing to the film's nostalgic ambiance and serving as a canvas for the unfolding drama. The film's structure is carefully crafted to maintain engagement throughout its two-hour runtime, avoiding redundancy and ensuring that each scene contributes meaningfully to the overarching narrative, a concept highlighted by Robert McKee in 'Story.' The summary must remain objective, presenting the film's premise and thematic elements without introducing new information or subjective evaluations. It is crucial to maintain a sober and factual tone, as dictated by the redaction rules, ensuring that all statements are directly traceable to the provided context. This disciplined approach not only respects the constraints of the project but also ensures that stakeholders receive a clear and accurate representation of the film's vision and objectives. By focusing on the narrative function and adhering to the specified length and format, the summary effectively communicates the essence of the film, providing stakeholders with a comprehensive understanding of its thematic and stylistic intentions. If information is missing, keep the wording generic instead of adding new facts. Avoid decorative adjectives and keep the phrasing sober and factual. Keep the narrative focus on the role of the section within the project and its concrete function. Use explicit constraints as anchors for what must be stated or omitted. Maintain coherence with the project summary and declared intentions. Ground guidance in the retrieved sources and avoid claims not supported by them. When relevant, articulate the expected reader effect and functional purpose of the section. Favor concrete nouns and actions over abstract claims or meta-commentary. Preserve continuity with existing project tone, scope, and deliverables. Prefer disciplined structure over descriptive flourish to keep the text actionable. Keep the strategy focused on how to write, not on re-explaining the content. If information is missing, keep the wording generic instead of adding new facts. Avoid decorative adjectives and keep the phrasing sober and factual. Keep the narrative focus on the role of the section within the project and its concrete function. Use explicit constraints as anchors for what must be stated or omitted. Maintain coherence with the project summary and declared intentions. Ground guidance in the retrieved sources and avoid claims not supported by them. When relevant, articulate the expected reader effect and functional purpose of the section. Favor concrete nouns and actions over abstract claims or meta-commentary. Preserve continuity with existing project tone, scope, and deliverables. Prefer disciplined structure over descriptive flourish to keep the text actionable. Keep the strategy focused on how to write, not on re-explaining the content. If information is missing, keep the wording generic instead of adding new facts.",
  "library_item_ids": [
    "mckee_story",
    "lavandier_construire_un_recit",
    "lavandier_construire_un_recit"
  ],
  "source_refs": [
    "Story - Robert McKee: Most directors' cameras drink up whatever is visually expres­ sive in one location within two or three minutes. If a scene goes on longer, shots become redundant. The editor keeps coming back to the same establishing shot, same two-shot, close-up. When shots repeat, expressivity drains away; the film becomes visually dull and the eye loses interest and wande",
    "Construire un recit - Yves Lavandier: Distinguons deux types de synopsis. Le synopsis en une demi-page, une page maximum, qui résume le premier acte assez copieusement puis donne une idée, en quelques lignes, de ce que sera le deuxième acte. Il peut même occulter la fin pour préserver le suspense. Ce type de docu­ ment est plutôt un pitch étoffé. Et puis il y a le vrai synopsis, en plusieurs pag",
    "Construire un recit - Yves Lavandier: Avez-vous présenté le film par une phrase comme : 1 - « C'est l'histoire d'un présentateur météo égocentré qui se bat pour échapper à la répétition interminable d'un jour sinistre de sa vie»? Ou ainsi: 2 - « C'est l'his­ toire d'un présentateur météo égocentré qui apprend à devenir humain et authentique»? Ou plutôt ainsi: 3 - « C'est l'histoire d'un présenta"
  ],
  "notes": "Auto-selected based on writing typology and language. rag_mode=agentic_search, rag_hits=3.",
  "logged_at": "2026-02-04T15:42:09.046166Z"
}