{
  "project_id": "satire_trump_greenland_clip_001",
  "strata": "n1",
  "updated_at": "2026-01-12T17:49:55.104224Z",
  "data": {
    "meta": {
      "status": "draft",
      "version": "0.1",
      "temperature_creative": 2
    },
    "pitch": "Un clip-satire court et violent, conçu comme un objet de choc : une fable grotesque où une figure de pouvoir transformée en mascotte impose sa vision du monde à coups de slogans, de gestes obscènes et d’images publicitaires.\n\nLe récit ne progresse pas par explication mais par collision : chaque tableau amplifie la logique du spectacle, de la marchandisation et de la domination jusqu’à ce que la réalité devienne méconnaissable — et pourtant familière.\n\nLe spectateur est pris à la gorge par une accumulation de signes (corps, drapeaux, argent, micros, foules), comme si la propagande se retournait contre elle-même et révélait sa propre monstruosité.\n\nIl n’y a pas de résolution ni de morale finale : le clip s’interrompt au moment où la saturation devient insoutenable, laissant une sensation de rire nerveux, de malaise et de honte par reconnaissance.",
    "intention": "Produire une expérience de sidération : faire ressentir avant de faire comprendre, et forcer le spectateur à traverser le dégoût, le rire et l’inconfort comme conditions d’accès au sens.\n\nAssumer la satire comme violence symbolique : pousser les mécanismes de pouvoir, de spectacle et d’infantilisation jusqu’à l’obscénité, non pour divertir gentiment, mais pour exposer ce qui est déjà à l’œuvre dans le réel.\n\nRefuser la pédagogie : le clip ne prouve rien, il accuse par excès ; le sens doit apparaître après coup, comme une idée fixe qui reste en tête et contamine le souvenir des images.",
    "axes_artistiques": "Axe 1 — Grotesque assumé : tout est trop grand, trop brillant, trop vulgaire ; la mise en scène est frontale, intruse, et transforme le pouvoir en carnaval obscène.\n\nAxe 2 — Saturation sensorielle : couleurs agressives, ruptures de rythme, répétitions absurdes, montée sonore et visuelle jusqu’à l’asphyxie ; le montage et le son deviennent les moteurs de la violence symbolique.",
    "dynamique_globale": "Le clip fonctionne comme une escalade : intrusion brutale, surenchère d’images-slogans, saturation, puis effondrement visuel et sonore — sans conclusion, sans apaisement, avec une coupure nette qui laisse le spectateur seul face au malaise.",
    "personnages": [
      {
        "name": "Le Président-Mascotte",
        "role": "Figure de pouvoir grotesque (icône-fiction)",
        "function": "Incarnation du spectacle politique : transformer tout en marchandise, réduire le langage à des slogans, hypnotiser la foule par la performance.",
        "description": "Un dirigeant caricatural, plus image que personne, qui parle en punchlines et existe dans une logique publicitaire permanente ; il ne réfléchit pas, il vend, et son corps est mis en scène comme un territoire de conquête.",
        "appearance": "Corps sur-signifiant, maquillage/teint artificiel, expression faciale théâtrale, gestuelle dominatrice et infantile ; présence envahissante en gros plans.",
        "signature": "Rictus de triomphe, pouces levés mécaniques, répétition de formules courtes, posture d’appropriation (il s’assoit partout comme si tout lui appartenait).",
        "images": [],
        "costumes": [
          {
            "description": "Costume trop ajusté et trop brillant, cravate agressive, accessoires ostentatoires (pin’s, bijoux), variations possibles : tenue \"show\" (paillettes) ou tenue \"martiale\" (surplus de symboles).",
            "images": []
          }
        ]
      },
      {
        "name": "La Foule-Écran",
        "role": "Chœur passif (collectif)",
        "function": "Réagir à l’image : applaudir, répéter, consommer, normaliser le grotesque ; servir de surface de projection au pouvoir.",
        "description": "Un ensemble de silhouettes interchangeables qui ne vivent qu’à travers le regard porté sur le leader ; la foule est un dispositif, pas une communauté.",
        "appearance": "Visages souriants figés, pancartes, vêtements de meeting, mouvements synchrones ; parfois des regards vides qui trahissent la mécanique.",
        "signature": "Rires automatiques, applaudissements en rafales, chants-slogans, gestes copiés-collés du leader.",
        "images": [],
        "costumes": [
          {
            "description": "Tenues de meeting uniformisées (casquettes, t-shirts, badges), palette volontairement criarde ; variations : foule \"VIP\" plus luxueuse, foule \"fan-zone\" plus vulgaire.",
            "images": []
          }
        ]
      }
    ],
    "monde_epoque": "Époque contemporaine très proche, mais légèrement décalée, comme un réel compressé et accéléré. Le monde obéit à une loi unique : tout se transforme en spectacle et en marchandise. Le grotesque y est normalisé, et l’absurde devient la forme ordinaire du pouvoir.",
    "esthetique": "Image saturée, agressive, presque publicitaire, avec des gros plans intrusifs et des cadrages instables qui empêchent toute distance confortable. Le montage privilégie la rupture, la répétition, la collision de tableaux, et une progression par surenchère plutôt que par narration explicative. La direction artistique transforme les symboles (drapeau, micro, argent, corps) en objets lourds, visibles, presque obscènes.",
    "son": {
      "ambiances": "Ambiances d’arène (meeting, foule, ventilation, bourdonnements) qui montent progressivement jusqu’à l’asphyxie.",
      "musique": "Musique martiale ou grotesque, utilisée comme propagande inversée : triomphale au départ puis de plus en plus dérangeante.",
      "sfx": "SFX signatures trop présents (flashs, caisses enregistreuses, buzzers, impacts sourds) pour matérialiser la marchandisation et l’agression symbolique.",
      "dialogues": "Dialogues réduits à des slogans, mots courts et répétitions, avec une diction performative plus proche du show que de la parole."
    },
    "motifs": [
      {
        "description": "Motif visuel central : le corps comme territoire (gros plans, gestes d’appropriation) et l’argent comme liquide/flux ; motif de variation : plus le clip avance, plus ces motifs deviennent littéraux, envahissants, et impossibles à ignorer.",
        "images": [],
        "audio": []
      },
      {
        "description": "Motif sonore central : applaudissements mécaniques + caisse enregistreuse/buzzer ; variation : le rythme se dérègle, les boucles se superposent, jusqu’à produire un malaise quasi physique.",
        "images": [],
        "audio": []
      }
    ],
    "ancres_canon_continuite": [
      "Aucune morale finale, aucune conclusion explicative : coupure nette en fin de saturation.",
      "Le Président-Mascotte est une icône-fiction (composite), jamais une intériorité réaliste.",
      "Le grotesque est la norme : tout élément doit sembler \"trop\" mais cohérent dans le monde.",
      "Montée par accumulation (intrusion → escalade → saturation → effondrement), sans découpage en actes.",
      "Symboles lourds et immédiats : corps/territoire, argent/flux, drapeau/objet domestique, micro/arme.",
      "Son agressif et signifiant : ambiances d’arène, musique triomphale qui tourne au dérangeant, SFX marchands."
    ],
    "sources": "[N] Narratologie : Aristote (imitation du grotesque), McKee (antagonisme), Truby (désir→action→effondrement), Lavandier (objectif/obstacles et action difficile à regarder) — mobilisés comme cadre de cohérence, pas comme dogme.\n[S] Références de style : clip-propagande, publicité agressive, farce noire, esthétique de saturation sensorielle (à préciser si besoin).\n[H] Hypothèse artistique : la sidération prime sur la compréhension immédiate ; le sens doit surgir après coup.",
    "hypotheses": "À VALIDER : durée cible du clip, niveau exact de vulgarité lexicale (slogans), et degré de référentialité (plus abstrait/composite vs plus directement reconnaissable).",
    "questions": "1) Tu vises quelle durée (30–45s / 60–90s / 2–3 min) ?\n2) Tu veux une satire plutôt \"composite\" (icône-fiction) ou plus frontalement reconnaissable (sans mentionner de noms) ?\n3) Le son : plutôt martiale (propagande) ou plutôt technoïde/indus (machine à spectacle) ?"
  }
}