{
  "project_id": "speedball",
  "strata": "n0_ui",
  "updated_at": "2026-02-01T20:00:26.437125Z",
  "source_updated_at": "2026-02-01T20:00:20.510127Z",
  "data": {
    "production_summary": {
      "summary": "Dans un clip palpitant de 90 secondes, les spectateurs sont transportés dans une arène futuriste où se déroule un sport de balle à haute intensité. Des hommes en rollers, équipés de casques et de gants à pointes, naviguent sur le terrain dynamique avec agilité et précision. L'atmosphère est chargée de musique dramatique hip-hop-classique, renforçant l'intensité et l'excitation du jeu. Cette histoire visuelle captivante capture l'essence d'un sport à la fois innovant et exaltant, sur fond d'un monde vibrant et futuriste.",
      "production_type": "clip",
      "target_duration": "",
      "aspect_ratio": "16:9"
    },
    "art_direction": {
      "description": "La direction artistique de ce clip de 90 secondes est une fusion vibrante d'esthétiques futuristes et athlétiques. Le décor est une arène élégante et high-tech où le sport se déroule avec une énergie dynamique. Des hommes en rollers, équipés de casques et de gants à pointes, glissent à travers l'arène avec précision et rapidité, incarnant un sentiment de puissance et d'agilité. Le style visuel se caractérise par des couleurs métalliques audacieuses et des designs angulaires et tranchants qui reflètent la nature de pointe du sport. Ce look distinctif est encore renforcé par un éclairage dramatique qui projette des ombres dynamiques, ajoutant profondeur et intensité aux scènes. L'esthétique globale est à la fois moderne et audacieuse, capturant l'essence d'un sport futuriste aussi palpitant que visuellement saisissant."
    },
    "sound_direction": {
      "description": "La direction sonore de ce clip de 90 secondes est une fusion de musique hip-hop dramatique et classique, créant une expérience auditive unique et captivante. La musique est conçue pour renforcer l'atmosphère futuriste et énergique du sport, avec des rythmes puissants et des éléments orchestraux qui soulignent l'intensité du jeu. Les influences hip-hop apportent une touche moderne et urbaine, tandis que les composants classiques ajoutent une couche de sophistication et de profondeur. Cette combinaison non seulement complète le spectacle visuel des hommes en rollers avec casques et gants à pointes, mais élève également la tension dramatique globale, rendant le paysage sonore à la fois distinctif et mémorable."
    }
  }
}