{
  "project_id": "speedball",
  "strata": "n0",
  "updated_at": "2026-02-02T10:15:59.421178Z",
  "data": {
    "production_summary": {
      "summary": "In a thrilling 90-second clip, witness a futuristic ball sport where athletes, clad in rollerblades and armed with spiked gloves, engage in a high-octane competition. The scene is set to the dramatic fusion of hip hop and classical music, enhancing the intensity and excitement of the game. This visual spectacle captures the essence of a dynamic and innovative sport, promising an exhilarating experience for viewers.",
      "production_type": "clip",
      "target_duration": "",
      "aspect_ratio": "16:9",
      "visual_style": "futuristic",
      "tone": "dramatic",
      "era": ""
    },
    "deliverables": {
      "visuals": {
        "images_enabled": true,
        "videos_enabled": true
      },
      "audio_stems": {
        "dialogue": true,
        "sfx": true,
        "music": true
      }
    },
    "art_direction": {
      "description": "The art direction for this 90-second clip centers around a futuristic and dynamic aesthetic, capturing the essence of a high-energy ball sport set in a sleek, advanced environment. The visual style is characterized by vibrant, neon-lit arenas that contrast with the dark, metallic tones of the players' gear. Men in rollerblades, equipped with spiked gloves, move with fluid agility, their movements accentuated by the reflective surfaces of their attire. The overall look is both gritty and polished, combining elements of urban street culture with a high-tech, sci-fi edge. This distinctive style is further enhanced by the dramatic interplay of light and shadow, creating a visually striking and immersive experience that is both modern and timeless.",
      "references": ""
    },
    "sound_direction": {
      "description": "The sound direction for this 90-second clip is a unique fusion of dramatic hip hop and classical music, creating an intense and dynamic auditory experience. The music is designed to complement the futuristic theme of the sport, with powerful beats and orchestral elements that enhance the drama and excitement of the gameplay. The hip hop influences bring a modern, edgy vibe, while the classical components add a layer of sophistication and depth. This combination ensures that the sound is both distinctive and memorable, perfectly capturing the essence of a high-energy, futuristic ball sport.",
      "references": ""
    }
  }
}