{
  "project_id": "speedball",
  "strata": "n0_ui",
  "updated_at": "2026-02-02T08:00:32.557811Z",
  "source_updated_at": "2026-02-02T08:00:25.072813Z",
  "data": {
    "production_summary": {
      "summary": "Dans une arène futuriste, un sport de balle à enjeux élevés se déroule, mêlant l'intensité de la compétition à l'élégance d'une danse chorégraphiée. Les joueurs, vêtus d'uniformes avancés et élégants, manœuvrent avec précision et agilité, leurs mouvements synchronisés à la fusion dramatique de la musique hip hop et classique. Alors que la balle s'élève dans les airs, la tension monte, capturant l'essence d'un monde où la prouesse athlétique rencontre l'expression artistique. Ce clip de 90 secondes plonge les spectateurs dans un spectacle captivant, où chaque passe et jeu est un témoignage de l'esprit dynamique et innovant du sport.",
      "production_type": "clip",
      "target_duration": "00:01:30",
      "aspect_ratio": "16:9"
    },
    "art_direction": {
      "description": "La direction artistique de ce clip de 90 secondes sur un sport de balle futuriste se caractérise par une esthétique élégante et high-tech qui fusionne des éléments de la culture urbaine de rue avec une technologie avancée. Le style visuel est défini par des lignes audacieuses et dynamiques et une palette de couleurs dominée par des argentés métalliques et des bleus profonds, accentués par des touches de néon qui évoquent une sensation de vitesse et d'énergie. Le cadre est une arène futuriste avec des affichages holographiques et des éléments interactifs qui renforcent l'immersion du spectateur. Ce style distinctif est encore accentué par l'intégration de musique dramatique hip hop-classique, qui complète l'intensité visuelle et ajoute une couche de sophistication et de drame à l'expérience globale."
    },
    "sound_direction": {
      "description": "La direction sonore de ce clip de 90 secondes est une fusion dynamique de musique hip hop et classique, créant une atmosphère dramatique et futuriste. La musique se caractérise par de puissantes cordes orchestrales entrelacées avec des rythmes hip hop, fournissant une toile de fond intense qui renforce l'excitation du sport de balle futuriste. Le paysage sonore est enrichi par des éléments électroniques qui ajoutent une touche moderne, rendant le son à la fois distinctif et mémorable. Ce mélange unique de genres non seulement complète l'intensité visuelle mais élève également le ton dramatique global du clip."
    }
  }
}