{
  "project_id": "speedball",
  "strata": "n0_ui",
  "updated_at": "2026-02-02T10:16:04.290643Z",
  "source_updated_at": "2026-02-02T10:15:59.421178Z",
  "data": {
    "production_summary": {
      "summary": "Dans un clip palpitant de 90 secondes, assistez à un sport de balle futuriste où des athlètes, vêtus de rollers et armés de gants à pointes, participent à une compétition à haute intensité. La scène est accompagnée d'une fusion dramatique de hip-hop et de musique classique, renforçant l'intensité et l'excitation du jeu. Ce spectacle visuel capture l'essence d'un sport dynamique et innovant, promettant une expérience exaltante pour les spectateurs.",
      "production_type": "clip",
      "target_duration": "",
      "aspect_ratio": "16:9"
    },
    "art_direction": {
      "description": "La direction artistique de ce clip de 90 secondes se concentre sur une esthétique futuriste et dynamique, capturant l'essence d'un sport de balle à haute énergie dans un environnement élégant et avancé. Le style visuel se caractérise par des arènes vibrantes et éclairées au néon qui contrastent avec les tons sombres et métalliques de l'équipement des joueurs. Des hommes en rollers, équipés de gants à pointes, se déplacent avec une agilité fluide, leurs mouvements accentués par les surfaces réfléchissantes de leur tenue. L'apparence générale est à la fois brute et raffinée, combinant des éléments de la culture urbaine de rue avec une touche high-tech et sci-fi. Ce style distinctif est encore renforcé par le jeu dramatique de la lumière et de l'ombre, créant une expérience visuelle saisissante et immersive qui est à la fois moderne et intemporelle."
    },
    "sound_direction": {
      "description": "La direction sonore de ce clip de 90 secondes est une fusion unique de hip-hop dramatique et de musique classique, créant une expérience auditive intense et dynamique. La musique est conçue pour compléter le thème futuriste du sport, avec des rythmes puissants et des éléments orchestraux qui renforcent le drame et l'excitation du jeu. Les influences hip-hop apportent une ambiance moderne et audacieuse, tandis que les composants classiques ajoutent une couche de sophistication et de profondeur. Cette combinaison garantit que le son est à la fois distinctif et mémorable, capturant parfaitement l'essence d'un sport de balle futuriste à haute énergie."
    }
  }
}