{
  "project_id": "speedball",
  "strata": "n0_ui",
  "updated_at": "2026-01-30T10:46:13.886545Z",
  "source_updated_at": "2026-01-30T10:46:05.878711Z",
  "data": {
    "production_summary": {
      "summary": "Dans une arène futuriste, des athlètes en roller s'engagent dans un sport de balle palpitant de 90 secondes, où l'agilité et la vitesse sont primordiales. La scène est mise en valeur par un mélange dramatique de hip-hop et de musique classique, rehaussant l'intensité et l'élégance du sport. Les athlètes, vêtus d'un équipement moderne et élégant, manœuvrent avec précision, leurs mouvements étant une danse d'athlétisme et de stratégie. L'atmosphère est chargée d'excitation, alors que la foule regarde avec admiration, captivée par le spectacle de ce sport innovant et dynamique.",
      "production_type": "clip",
      "target_duration": "",
      "aspect_ratio": "16:9"
    },
    "art_direction": {
      "description": "La direction artistique du clip de 90 secondes sur un sport de balle futuriste avec des athlètes en roller se caractérise par une esthétique moderne et élégante qui met l'accent sur la vitesse et l'agilité. Le style visuel intègre des éléments métalliques et néon, reflétant la technologie avancée et la nature dynamique du sport. Les costumes des athlètes sont conçus avec des lignes aérodynamiques et des couleurs vives qui se détachent sur le décor urbain, renforçant le sens du mouvement et de l'énergie. Le décor est une ville futuriste avec des gratte-ciels imposants et des arènes vastes, créant un environnement dramatique et immersif. Ce style distinctif est encore accentué par l'utilisation d'angles de caméra dynamiques et d'un montage rapide, capturant l'intensité et l'excitation du sport. L'apparence générale est à la fois avant-gardiste et visuellement frappante, la rendant instantanément reconnaissable et mémorable."
    },
    "sound_direction": {
      "description": "Le paysage sonore de la vidéo est une fusion captivante de hip-hop et de musique classique, créant une expérience auditive dramatique et unique. Les rythmes et lignes de basse du hip-hop apportent une touche énergique et moderne, tandis que les éléments orchestraux de la musique classique ajoutent profondeur et grandeur. Ce mélange non seulement renforce le thème futuriste du sport, mais souligne également l'intensité et le dynamisme des athlètes en roller en action. Le ton dramatique de la musique est encore accentué par l'utilisation de crescendos puissants et de mélodies complexes, la rendant à la fois distinctive et mémorable."
    }
  }
}